In [1]:
#Load Libraries
import pandas as pd
import numpy as np

In [2]:
#Load Data
data = pd.DataFrame(
       [['female', 'New York', 'low', 4], ['female', 'London', 'medium', 3], ['male', 'New Delhi', 'high', 2]],
       columns=['Gender', 'City', 'Temperature', 'Rating'])
data

   Gender       City Temperature  Rating
0  female   New York         low       4
1  female     London      medium       3
2    male  New Delhi        high       2

In [3]:
#Using LabelEncoder
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
data['City_encoded'] = encoder.fit_transform(data['City'])
data[['City', 'City_encoded']] # special syntax to get just these two columns

        City  City_encoded
0   New York             2
1     London             0
2  New Delhi             1

In [4]:
#Get Dummies
data = pd.concat([data, pd.get_dummies(data['City'], prefix='City')], axis=1)
data[['City', 'City_London', 'City_New Delhi', 'City_New York']]

        City  City_London  City_New Delhi  City_New York
0   New York            0               0              1
1     London            1               0              0
2  New Delhi            0               1              0

In [5]:
#Using Mapping
data['Temperature_encoded'] = data['Temperature'].map( {'low':0, 'medium':1, 'high':2})
data[['Temperature', 'Temperature_encoded']]

  Temperature  Temperature_encoded
0         low                    0
1      medium                    1
2        high                    2

In [6]:
'''
Let's Try some examples
'''

"\nLet's Try some examples\n"

In [7]:
# Load Libraries
import pandas as pd
from io import StringIO
%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [8]:
#Create Dataset
import pandas as pd
from io import StringIO
csv_data='''A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,,8.0
0.0,11.0,12.0,'''
csv_data=unicode(csv_data)
df=pd.read_csv(StringIO(csv_data))
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [9]:
#Identify Null Values
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False   True  False
2  False  False  False   True

In [10]:
#Sum of Null Values by Column
df.isnull().sum()

A    0
B    0
C    1
D    1
dtype: int64

In [11]:
#Drop all Null Values
df.dropna().reset_index(drop = True)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [12]:
#Drop all Null Values Columns
df.dropna(axis=1).reset_index(drop = True)

     A     B
0  1.0   2.0
1  5.0   6.0
2  0.0  11.0

In [13]:
#Only drop rows where all columns are NaN
df.dropna(how='all').reset_index(drop = True)

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   NaN  8.0
2  0.0  11.0  12.0  NaN

In [14]:
#Drop rows that do not have a least 4 non-NaN values
df.dropna(thresh=4).reset_index(drop = True)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [15]:
#Only drop rows where NaN appear in specific columns (here: 'C')
df.dropna(subset=['C']).reset_index(drop = True)

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  0.0  11.0  12.0  NaN

In [16]:
#Using Imputer - Convert Null Values using Mean of the Column
from sklearn.impute import SimpleImputer
imputer=SimpleImputer(missing_values=np.nan,strategy='mean')
imputer = imputer.fit(df)
imputed_data=imputer.transform(df.values)
df[df.columns] = SimpleImputer(missing_values=np.nan,strategy='mean').fit_transform(df)
df

     A     B     C    D
0  1.0   2.0   3.0  4.0
1  5.0   6.0   7.5  8.0
2  0.0  11.0  12.0  6.0

In [17]:
#Dealing with Categorical Data
df=pd.DataFrame([['green','M',10.1,'class1'],
               ['red','L',13.5,'class2'],
               ['blue','XL',15.3,'class1']])
df.columns =['color','size','price','classlabel']
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

In [18]:
#Using Mapping
size_mapping ={'XL':3,'L':2,'M':1}
df['size']=df['size'].map(size_mapping)
df

   color  size  price classlabel
0  green     1   10.1     class1
1    red     2   13.5     class2
2   blue     3   15.3     class1

In [19]:
#Mapping Overview
size_mapping.items()

dict_items([('XL', 3), ('L', 2), ('M', 1)])

In [20]:
#Reverse mapping
inv_size_mapping = {v: k for k, v in size_mapping.items()}
df['size']=df['size'].map(inv_size_mapping)
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

In [21]:
#Show the Unique Class Labels
np.unique(df['classlabel'])

array(['class1', 'class2'], dtype=object)

In [22]:
#Automatic Class Labeling
class_mapping ={label:idx for idx, label in enumerate(np.unique(df['classlabel']))}
df['classlabel'] = df['classlabel'].map(class_mapping)
df

   color size  price  classlabel
0  green    M   10.1           0
1    red    L   13.5           1
2   blue   XL   15.3           0

In [23]:
#Inverse Mapping
inv_class_mapping = {v: k for k, v in class_mapping.items()}
df['classlabel']=df['classlabel'].map(inv_class_mapping)
df

   color size  price classlabel
0  green    M   10.1     class1
1    red    L   13.5     class2
2   blue   XL   15.3     class1

In [24]:
#Using LabelEncoder
from sklearn.preprocessing import LabelEncoder
X=df[['color','size','price']].values
X

array([['green', 'M', 10.1],
       ['red', 'L', 13.5],
       ['blue', 'XL', 15.3]], dtype=object)

In [25]:
#Convert the Color Column into Binary Values using LabelEncoder
color_label_encoder=LabelEncoder()
X[:,0]=color_label_encoder.fit_transform(X[:,0])
X

array([[1, 'M', 10.1],
       [2, 'L', 13.5],
       [0, 'XL', 15.3]], dtype=object)

In [26]:
#Using Mapping
size_mapping ={'XL':3,'L':2,'M':1}
df['size']=df['size'].map(size_mapping)
X = df[['color','size','price']].values
X

array([['green', 1, 10.1],
       ['red', 2, 13.5],
       ['blue', 3, 15.3]], dtype=object)

In [27]:
#Using OneHotEncoder
from sklearn.preprocessing import OneHotEncoder
one_hot_encoder=OneHotEncoder(categories='auto')
one_hot_encoder

OneHotEncoder(categorical_features=None, categories='auto', drop=None,
              dtype=<class 'numpy.float64'>, handle_unknown='error',
              n_values=None, sparse=True)

In [28]:
#Apply one_hot_encoder to Dataset
one_hot_encoder.fit_transform(X).toarray()

array([[0., 1., 0., 1., 0., 0., 1., 0., 0.],
       [0., 0., 1., 0., 1., 0., 0., 1., 0.],
       [1., 0., 0., 0., 0., 1., 0., 0., 1.]])

In [29]:
#View Feature Names in One_hot_Encoder
one_hot_encoder.get_feature_names()

array(['x0_blue', 'x0_green', 'x0_red', 'x1_1', 'x1_2', 'x1_3', 'x2_10.1',
       'x2_13.5', 'x2_15.3'], dtype=object)

In [30]:
'''Another way which is more convenient is to create those
dummy features via one-hot encoding is to use the
pandas.get_dummies() method. Applied on a DataFrame,
the get_dummies() method will only convert string columns
and leave all other columns unchanged'''

pd.get_dummies(df[['price','color','size']])

   price  size  color_blue  color_green  color_red
0   10.1     1           0            1          0
1   13.5     2           0            0          1
2   15.3     3           1            0          0

In [31]:
#Removing Dulplicates
dataorg = {'Name': ['James', 'Alice', 'Phil', 'James'],
        'Age': [24, 28, 40, 24],
        'Sex': ['Male', 'Female', 'Male', 'Male']}
dforg = pd.DataFrame(dataorg)
print(dforg)

    Name  Age     Sex
0  James   24    Male
1  Alice   28  Female
2   Phil   40    Male
3  James   24    Male

In [32]:
#Drop Dulplicates
df_drop = dforg.drop_duplicates()
print(df_drop)

    Name  Age     Sex
0  James   24    Male
1  Alice   28  Female
2   Phil   40    Male

In [33]:
#Keep 1st entry sorted by Age
dforg2 = dforg.sort_values('Age', ascending=False)
df_drop2 = dforg2.drop_duplicates(subset='Name', keep='first')
print(df_drop2)

    Name  Age     Sex
2   Phil   40    Male
1  Alice   28  Female
0  James   24    Male